app/Controllers/Alumno.php

    public function editar($id){
        $alumnoModel=model('AlumnoModel');
        $data['alumno']=$alumnoModel->find($id);
---
SELECT *
FROM `alumno`
WHERE `alumno`.`deleted_at` IS NULL