app/Controllers/Alumno.php

    public function mostrar(){

        $session = session();
        if($session->get('logged_in')!=TRUE){
            return redirect('/','refresh');
        }
        $alumnoModel = model('AlumnoModel');
        $data['alumnos']=$alumnoModel->findAll();
---
SELECT *
FROM `alumno`
WHERE `alumno`.`deleted_at` IS NULL

    public function agregar(){

        $session = session();
        if($session->get('logged_in')!=TRUE){
            return redirect('/','refresh');
        }

        $gradoModel = model('GradoModel');
        $data['grados'] = $gradoModel->findAll();

        $grupoModel = model('GrupoModel');
        $data['grupos'] = $grupoModel->findAll();
---
SELECT *
FROM `Grados`
SELECT *
FROM `Grupos`