app/Controllers/Alumno.php

INSERT INTO `alumno` (`nombre`, `sexo`, `fechaNacimiento`) VALUES ('Pablo', 'Hombre', '2000-01-01')
---
    public function insert(){
        $alumnoModel = model('AlumnoModel');
        $data = array(
            "nombre"=>$_POST['nombre'],
            "sexo"=>$_POST['sexo'],
            "fechaNacimiento"=>$_POST['fechaNacimiento']
        );
        $alumnoModel->insert($data);