app/Controllers/Carrera.php

    public function mostrar(){
        $carreraModel = model('CarreraModel');
        $data['carreras']=$carreraModel->findAll();
---
SELECT *
FROM `carreras`
WHERE `carreras`.`deleted_at` IS NULL

    public function editar($id){
        $carreraModel=model('CarreraModel');
        $data['carrera']=$carreraModel->find($id);
---
SELECT *
FROM `carreras`
WHERE `carreras`.`deleted_at` IS NULL
AND `carreras`.`id` = '35'

    public function update(){
        $carreraModel = model('CarreraModel');

        $data = array(
            "nombre"=>$_POST['nombre'],
            "acronimo"=>$_POST['acronimo']
        );
        $carreraModel->update($_POST['id'],$data);
---
UPDATE `carreras` SET `nombre` = 'Ingeniería en turismo', `acronimo` = 'ing-015'
WHERE `carreras`.`id` IN ('35')

    public function buscar(){
        $carreraModel = model('CarreraModel');

        if(isset($_GET['nombre']) && isset($_GET['acronimo'])){
            $nombre = $_GET['nombre'];
            $acronimo = $_GET['acronimo'];
            $data['carreras']=$carreraModel->like('nombre',$nombre)
                                ->like('acronimo',$acronimo)
                                ->findAll();
        }
        else {
            $nombre ="";
            $acronimo="";
            $data['carreras']=$carreraModel->findAll();
---
SELECT *
FROM `carreras`
WHERE `carreras`.`deleted_at` IS NULL