app/Controllers/Home.php

    public function index()
    {
        $validation =  \Config\Services::validation();
            if (strtolower($this->request->getMethod()) === 'get'){
                return view('common/head') .
                view('home/login') .
                view('common/footer');
            }

            $rules = [
                'email' => 'required',
                'pass'=>'required'
            ];

            if (! $this->validate($rules)) {
                return view('common/head') .
                view('home/login') .
                view('common/footer');
            }
            else{
                //si pasa las reglas
                $email = $_POST['email'];
                $password = $_POST['pass'];
                $userModel = model('UsuarioModel');
                $data['usuario']= $userModel->like('email',$email)
                                ->Like('pass',$password)
                                ->findAll();
---
SELECT *
FROM `usuarios`
WHERE `email` LIKE '%l21te0131@teziutlan.tecnm.mx%' ESCAPE '!'
AND  `pass` LIKE '%AngellitA.3110%' ESCAPE '!'
AND `usuarios`.`deleted_at` IS NULL