app/Controllers/Materia.php

SELECT *
FROM `materia`
WHERE `materia`.`deleted_at` IS NULL
---
    public function mostrar(){
        $materiaModel = model('MateriaModel');
        $data['materias']=$materiaModel->findAll();

INSERT INTO `materia` (`nombre`, `nombreCorto`, `clave`, `noUnidades`) VALUES ('prueba', '12345', 'P123', '8')
---
    public function insert(){
        $materiaModel = model('MateriaModel');

        $data = array(
            "nombre"=>$_POST['nombre'],
            "nombreCorto"=>$_POST['nombreCorto'],
            "clave"=>$_POST['clave'],
            "noUnidades"=>$_POST['noUnidades']
        );

        $materiaModel->insert($data);

SELECT *
FROM `materia`
WHERE `materia`.`deleted_at` IS NULL
AND `materia`.`idMateria` = '3'
---
    public function editar($idMateria){
        $materiaModel=model('MateriaModel');
        $data['materia']=$materiaModel->find($idMateria);

SELECT *
FROM `materia`
WHERE `nombre` LIKE '%e%' ESCAPE '!'
AND  `nombreCorto` LIKE '%%' ESCAPE '!'
AND  `clave` LIKE '%0%' ESCAPE '!'
AND  `noUnidades` LIKE '%%' ESCAPE '!'
AND `materia`.`deleted_at` IS NULL
SELECT *
FROM `materia`
WHERE `materia`.`deleted_at` IS NULL
---
    public function buscar(){
        $materiaModel = model('MateriaModel');

        if(isset($_GET['nombre']) && isset($_GET['nombreCorto']) && isset($_GET['clave']) && isset($_GET['noUnidades'])){
            $nombre = $_GET['nombre'];
            $nombreCorto = $_GET['nombreCorto'];
            $clave = $_GET['clave'];
            $noUnidades = $_GET['noUnidades'];
            $data['materias']=$materiaModel->like('nombre',$nombre)
                                ->like('nombreCorto',$nombreCorto)
                                ->like('clave',$clave)
                                ->like('noUnidades',$noUnidades)
                                ->findAll();
        }
        else {
            $nombre ="";
            $sexo="";
            $clave="";
            $noUnidades="";
            $data['materias']=$materiaModel->findAll();